//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		CollisionInterface.cpp
//!
//! @summary	衝突判定用のインターフェイスクラスのソースファイル
//!
//! @date		2018.11.30
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み =================================================
// <自作ヘッダーファイル>
#include "CollisionInterface.h"


// usingディレクティブ =====================================================
using namespace std;
using namespace Library;


// 関数の定義 ==============================================================
//--------------------------------------------------------------------
//! @summary   コンストラクタ
//!
//! @parameter [void] なし
//--------------------------------------------------------------------
Collision::CollisionInterface::CollisionInterface()
{
	// 何もしない
}



//--------------------------------------------------------------------
//! @summary   デストラクタ
//!
//! @parameter [void] なし
//--------------------------------------------------------------------
Collision::CollisionInterface::~CollisionInterface()
{
}



//--------------------------------------------------------------
//! @summary   衝突しているときに呼ばれる処理
//!
//! @parameter [collider] 衝突しているコライダー
//!
//! @return    なし
//--------------------------------------------------------------
void Collision::CollisionInterface::OnCollision(CollisionShape* collider)
{
	// 何もしない
}
