//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		CubeShape.h
//!
//! @summary	立方体状衝突判定クラスのヘッダファイル
//!
//! @date		2018.11.26
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 =========================================================
#pragma once



// ヘッダファイルの読み込み =======================================================
// プリコンパイル済みヘッダファイル
#include "../../pch.h"

// <自作ヘッダファイル>
#include "CollisionShape.h"


// 名前空間の定義 ================================================================
namespace Library
{
	namespace Collision
	{
		// クラスの定義 ==========================================================
		class CubeShape : public CollisionShape
		{
			// <メンバ変数>
		private:
			// サイズ
			DirectX::SimpleMath::Vector3 m_size;


			// <コンストラクタ>
		public:
			//--------------------------------------------------------------
			//! @parameter [controller] 制御コンポーネント
			//! @parameter [transform] 座標変換コンポーネント
			//! @parameter [size] 立方体のサイズ
			//--------------------------------------------------------------
			CubeShape(System::ControllerBase* controller, Math::Transform& transform, const DirectX::SimpleMath::Vector3& size);


			// <デストラクタ>
		public:
			~CubeShape();


			// <ゲッター関数>
		public:
			//--------------------------------------------------------------
			//! @summary   サイズの取得
			//--------------------------------------------------------------
			inline const DirectX::SimpleMath::Vector3& GetSize() const { return m_size; }
		};
	}
}
