//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		ScoreManager.cpp
//!
//! @summary	モトスのスコア管理クラスのソースファイル
//!
//! @date		2018.10.31
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み =================================================
// <自作ヘッダーファイル>
#include "ScoreManager.h"


// usingディレクティブ =====================================================
using namespace std;


// 関数の定義 ==============================================================
//--------------------------------------------------------------------
//! @summary   コンストラクタ
//!
//! @parameter [void] なし
//--------------------------------------------------------------------
Motos::Utility::ScoreManager::ScoreManager() :
	m_highScore(0),
	m_nowScore(0)
{
	// 何もしない
}



//--------------------------------------------------------------------
//! @summary   デストラクタ
//!
//! @parameter [void] なし
//--------------------------------------------------------------------
Motos::Utility::ScoreManager::~ScoreManager()
{
	// 何もしない
}



//--------------------------------------------------------------------
//! @summary   初期化処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void Motos::Utility::ScoreManager::Initialize()
{
	m_nowScore = 0;
}



//--------------------------------------------------------------------
//! @summary   スコアに加算
//!
//! @parameter [addValue] 加算する値
//!
//! @return    なし
//--------------------------------------------------------------------
void Motos::Utility::ScoreManager::AddScore(int addValue)
{
	m_nowScore += addValue;
}



//--------------------------------------------------------------------
//! @summary   ハイスコアの更新
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void Motos::Utility::ScoreManager::UpdateHighScore()
{
	m_highScore = (m_highScore < m_nowScore) ? m_nowScore : m_highScore;
}
