//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		Game.cpp
//!
//! @summary	ゲームクラスのソースファイル
//!
//! @date		2018.09.18
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み =================================================
// <プリコンパイル済みヘッダファイル>
#include "../pch.h"

// <自作ヘッダーファイル>
#include "Game.h"


// 共有する変数・関数の宣言 =================================================
// ゲーム終了関数
extern void ExitGame();


// usingディレクティブ =====================================================
using namespace std;
using namespace DirectX;
using namespace DirectX::SimpleMath;
using namespace Library;


// 定数の定義 ==============================================================
// ゲームタイトル
const wstring Game::GAME_TITLE = L"Game";


// 関数の定義 ==============================================================
//--------------------------------------------------------------------
//! @summary   コンストラクタ
//!
//! @parameter [hInstance]
//! @parameter [nCmdShow]
//--------------------------------------------------------------------
Game::Game(HINSTANCE hInstance, int nCmdShow) :
	Framework(hInstance, nCmdShow, SCREEN_WIDTH, SCREEN_HEIGHT, GAME_TITLE)
{
	// 何もしない
}



//--------------------------------------------------------------------
//! @summary   初期化処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void Game::Initialize()
{

}



//--------------------------------------------------------------------
//! @summary   終了処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void Game::Finalize()
{

}



//--------------------------------------------------------------------
//! @summary   更新処理
//!
//! @parameter [timer] 時間情報
//!
//! @return    なし
//--------------------------------------------------------------------
#pragma region Frame Update
void Game::Update(const Common::StepTimer & timer)
{

}
#pragma endregion



//--------------------------------------------------------------------
//! @summary   描画処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
#pragma region Frame Render
void Game::Render()
{

}
#pragma endregion
