//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		Round.h
//!
//! @summary	モトスのラウンド表示クラスのヘッダファイル
//!
//! @date		2018.11.13
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 =========================================================
#pragma once



// ヘッダファイルの読み込み =======================================================
// <自作ヘッダーファイル>
#include "Number.h"


// 名前空間の定義 ================================================================
namespace Motos
{
	namespace Play
	{
		namespace Object
		{
			namespace UI
			{
				// クラスの定義 ==================================================
				class Round
				{
					// <メンバ変数>
				private:
					// ハイフン
					Library::Graphic2D::Sprite* m_hyphen;
					// 数字
					Number* m_number;
					// 表示する座標
					DirectX::SimpleMath::Vector2 m_position;
					// ビューポート
					D3D11_VIEWPORT m_viewport;


					// <コンストラクタ>
				public:
					//------------------------------------------------------
					//! @summary   コンストラクタ
					//!
					//! @parameter [void] なし
					//------------------------------------------------------
					Round();


					// <デストラクタ>
				public:
					~Round();


					// <メンバ関数>
				public:
					//------------------------------------------------------
					//! @summary   描画処理
					//!
					//! @parameter [roundNumber] 表示するラウンド数
					//!
					//! @return    なし
					//------------------------------------------------------
					void Draw(int roundNumber);


					// <セッター関数>
				public:
					//------------------------------------------------------
					//! @parameter [position] 座標
					//------------------------------------------------------
					inline void SetPosition(const DirectX::SimpleMath::Vector2& position) { m_position = position; }


					//------------------------------------------------------
					//! @parameter [viewport] ビューポート
					//------------------------------------------------------
					inline void SetViewport(const D3D11_VIEWPORT& viewport) { m_viewport = viewport; }
				};
			}
		}
	}
}
