//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		SceneBase.h
//!
//! @summary	基底シーンクラスのヘッダファイル
//!
//! @date		2018.01.15
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 =========================================================
#pragma once



// ヘッダファイルの読み込み =======================================================
// <自作ヘッダファイル>
#include "../Common/StepTimer.h"


// 名前空間の定義 ================================================================
namespace Library
{
	namespace Scene
	{
		// クラスの定義 ==========================================================
		class SceneBase
		{
			// <コンストラクタ>
		public:
			//--------------------------------------------------------------
			//! @parameter [void] なし
			//--------------------------------------------------------------
			SceneBase();


			// <デストラクタ>
		public:
			virtual ~SceneBase();


			// <メンバ関数>
		public:
			// 初期化処理
			virtual void Initialize() = 0;

			// 更新処理
			virtual void Update(const Common::StepTimer& timer) = 0;

			// 描画処理
			virtual void Render() = 0;

			// 終了処理
			virtual void Finalize() = 0;

		};
	}
}