//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		DebugCamera.h
//!
//! @summary	デバッグ用カメラクラスのヘッダファイル
//!
//! @date		2018.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 =========================================================
#pragma once


// ヘッダファイルの読み込み =======================================================
// <プリコンパイル済みヘッダファイル>
#include "../../pch.h"

// <自作ヘッダファイル>
#include "../Camera/Camera.h"
#include "../Math/Transform.h"


// 名前空間の定義 ================================================================
namespace Library
{
	namespace Debug
	{
		// クラスの定義 ==========================================================
		class DebugCamera : public Camera::Camera
		{
			// <デバッグ時に使用する変数>
		private:
			// クリックされた時のマウス座標の保存
			DirectX::SimpleMath::Vector2 m_startMousePosition;

			// クリック中のマウス座標の保存
			DirectX::SimpleMath::Vector2 m_nowMousePosition;


			// <コンストラクタ>
		public:
			//--------------------------------------------------------------
			//! @parameter [void] なし
			//--------------------------------------------------------------
			DebugCamera();


			// <メンバ関数>
			//--------------------------------------------------------------
			//! @summary   更新処理
			//!
			//! @parameter [void] なし
			//!
			//! @return    なし
			//--------------------------------------------------------------
			void Update() override;


			// <セッター関数>
		public:
			//--------------------------------------------------------------
			//! @parameter [parent] 親のTransform
			//--------------------------------------------------------------
			inline void SetParent(Math::Transform* parent) override {}


			//--------------------------------------------------------------
			//! @parameter [position] 視点の座標
			//--------------------------------------------------------------
			inline void SetEyePosition(const DirectX::SimpleMath::Vector3& position) override {}


			//--------------------------------------------------------------
			//! @parameter [eulerAngles] 視点の座標
			//--------------------------------------------------------------
			inline void SetEulerAngles(const DirectX::SimpleMath::Vector3& eulerAngles) override {}


			//--------------------------------------------------------------
			//! @parameter [rotation] 回転角
			//--------------------------------------------------------------
			inline void SetRotation(const DirectX::SimpleMath::Quaternion& rotation) override {}

		};
	}
}
