//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		ModelBone.h
//!
//! @summary	モデルのボーンクラスのヘッダファイル
//!
//! @date		2018.10.23
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 =========================================================
#pragma once



// ヘッダファイルの読み込み =======================================================
// <プリコンパイル済みヘッダファイル>
#include "../../../pch.h"


// 名前空間の定義 ================================================================
namespace Library
{
	namespace Graphic3D
	{
		namespace Model
		{
			// クラスの定義 ======================================================
			class ModelBone
			{
				// <メンバ変数>
				// ボーンの名前
				std::string m_name;
				// 親のボーン番号
				unsigned int parentNumber;


				// <コンストラクタ>
			public:
				//----------------------------------------------------------
				//! @parameter [void] なし
				//----------------------------------------------------------
				ModelBone();


				// <デストラクタ>
			public:
				~ModelBone();


				// <メンバ関数>
			public:
			};
		}
	}
}
